# ResList_IsSelValid

## Description
Determine if the selection in the popup is valid. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
FUNCTION ResList_IsSelValid(uniqueID : STRING): BOOLEAN;
```

```python
def vs.ResList_IsSelValid(uniqueID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Document List Handling